$(function(){
	
	function myChartData10callBack(msg){
	  
		var data={};
	 
		var month={};
		for(var i=0;i<msg[0]["technoloMonths"].length;++i){
			var years=msg[0]["technoloMonths"][i]["idx_month"].split("-");
			if(years[1]==1){
				month={};
			}
			if(years[0]>2010){
			 
			month[years[1]]=msg[0]["technoloMonths"][i]["idx_value"];
			if(years[1]==11){
				data[years[0]]=month;
			}
			}
			
			 
		}
		 
		 
		myChartData10(data);
	}
	ajaxUnitFirst("data_unitsql.action", 
			{sql:" where idx_1='交通固定资产投资' and idx_2='全国' and	idx_3='累计值'" +
					" and idx_7='物流大数据'  "}, 
			myChartData10callBack);
function myChartData10(data){
	var years=function(){
		var arr=[];
		var cnt=0;
		for(var attr in data){
			arr[cnt++]=attr;
		}
		return arr;
	}();
	var months=['01','02','03','04','05','06','07','08','09','10','11'];
	
	var myChart = echarts.init(document.getElementById('container'));
    option = {
    	title : {
    		show : 'true',
			text : '交通固定资产投资',
			// 2342	月  idx_1='交通固定资产投资' and idx_2='全国' and	idx_3='累计值' and idx_7='物流大数据'

			subtext : '累计值（万元）',
			x : 'center',
			y : 'top',
			textAlign : 'center',
    	},
	    tooltip : {
	        trigger: 'axis'
	    },
	    legend: {
	        data://['2013交通固定资产投资','2014交通固定资产投资','2015交通固定资产投资'],
	        function(){
	        	var arr=[];
	        	for(var i=0;i<years.length;++i){
	        		arr[i]=years[i]+'交通固定资产投资';
	        	}
	        	return arr;
	        }(),
	        x : 'center',
	    	y : 'bottom',
	    	orient : 'horizontal',//horizontal
	    	padding : '-1',
	    },
	    toolbox: {
	        show : true,
	        feature : {
	            mark : {show: true},
	            dataView : {show: true, readOnly: false},
	            magicType : {show: true, type: ['line', 'bar', 'stack', 'tiled']},
	            restore : {show: true},
	            saveAsImage : {show: true}
	        }
	    },
	    calculable : true,
	    xAxis : [
	        {
	            type : 'category',
	            boundaryGap : false,
	            data : ['1月','2月','3月','4月','5月','6月','7月','8月','9月','10月','11月']
	        }
	    ],
	    yAxis : [
	        {
	            type : 'value'
	        }
	    ],
//总投资
//4588863.00, 9088192.00, 18283850.00, 29085055.00, 42249352.00, 59964222.00, 75118651.00, 88611092.00, 105764857.00, 121880298.00, 139760290.00
//5446848.00, 10811651.00, 20695519.00, 32054301.00, 45492064.00, 65628015.00, 81994787.00, 99345112.00, 118488140.00, 136831667.00, 155050770.00
//7353645.00, 13006983.00, 23794488.00, 36087315.00, 51248704.00, 71880886.00, 88947688.00, 106952134.00, 126688952.00, 145770160.00, 165479426.00
//东部
//1704242.00, 3153338.00, 6752075.00, 10461981.00, 15080635.00, 21001980.00, 26103890.00, 30583733.00, 36353228.00, 42424387.00, 48774440.00
//1463051.00, 3278120.00, 6874119.00, 10857324.00, 15412773.00, 21980000.00, 27752037.00, 33552815.00, 39895713.00, 46192533.00, 52830478.00
//2314026.00, 4235531.00, 7421164.00, 11727236.00, 16239668.00, 23146371.00, 29204664.00, 34856899.00, 41102664.00, 47392369.00, 54033149.00
//中部
//864037.00, 1867999.00, 3780797.00, 6701645.00, 9865013.00, 14741588.00, 18536370.00, 21799446.00, 26583088.00, 30103026.00, 35052377.00
//1188888.00, 2326026.00, 4761291.00, 6985129.00, 10005408.00, 14524626.00, 18043858.00, 21748639.00, 26679927.00, 31246107.00, 37037818.00,
//1462008.00, 3166157.00, 5367870.00, 8051992.00, 12004116.00, 16980596.00, 20429465.00, 24802370.00, 30294535.00, 35251676.00, 41298963.00
//西部
//2020584.00, 4066855.00, 7750978.00, 11921429.00, 17303704.00, 24220654.00, 30478391.00, 36227913.00, 42828541.00, 49352885.00, 55933473.00
//2794908.00, 5207505.00, 9060109.00, 14211849.00, 20073883.00, 29123388.00, 36198893.00, 44043657.00, 51912499.00, 59393028.00, 65182474.00
//3577611.00, 5605295.00, 11005454.00, 16308087.00, 23004921.00, 31753919.00, 39313559.00, 47292865.00, 55291753.00, 63126115.00, 70147314.00


	    
	    series :
	    	function(){
	    	var mapp=[];
	    	for(var i=0;i<years.length;++i){
	    		mapp[i]={
	    	            name:years[i]+'交通固定资产投资',
	    	            type:'line',
	    	            stack: '累计值',
	    	            data://[4588863.00, 9088192.00, 18283850.00, 29085055.00, 42249352.00, 59964222.00, 75118651.00, 88611092.00, 105764857.00, 121880298.00, 139760290.00]
	    	            	function(){
	    	            	var arr=[];
	    	            	for(var j=0;j<months.length;++j){
	    	            		arr[j]=data[years[i]][months[j]];
	    	            	}
	    	            	return arr;
	    	            }()
	    		}
	    	}
	    	return mapp;
	    }()
	    	/*[{
	            name:'2013交通固定资产投资',
	            type:'line',
	            stack: '累计值',
	            data:[4588863.00, 9088192.00, 18283850.00, 29085055.00, 42249352.00, 59964222.00, 75118651.00, 88611092.00, 105764857.00, 121880298.00, 139760290.00]
	        },
	        {
	            name:'2014交通固定资产投资',
	            type:'line',
	            stack: '累计值',
	            data:[5446848.00, 10811651.00, 20695519.00, 32054301.00, 45492064.00, 65628015.00, 81994787.00, 99345112.00, 118488140.00, 136831667.00, 155050770.00]
	        },
	        {
	            name:'2015交通固定资产投资',
	            type:'line',
	            stack: '累计值',
	            data:[7353645.00, 13006983.00, 23794488.00, 36087315.00, 51248704.00, 71880886.00, 88947688.00, 106952134.00, 126688952.00, 145770160.00, 165479426.00]
	        },
	    ]
*/	};
                    
	
	
	
	
    myChart.setOption(option);
}        
}) 
